
const _data=[
	{id:1,title:'阅读优秀的作品',image:'https://img2.baidu.com/it/u=1988718780,571408681&fm=253&fmt=auto&app=120&f=JPEG?w=640&h=427',type:'大纲写作',assimt:2335, like:12532, date:'2023-03-25',desc:'这是显而易见的，但立竿见影的方法。',content:'这是显而易见的，但立竿见影的方法。如果你不读更多的好作品，你就不知道如何写出更好的作品。优秀的作家都是从阅读别人的佳作开始，接着开始模仿，最后超越他们，形成自己的风格。尽可能的多读名著，在看内容的时候，更要留意文章的问题和写作的技巧。', },
	{id:2,title:'尽可能多的写',image:'https://img1.baidu.com/it/u=183207286,2861482740&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=281',type:'大纲写作',assimt:2154, like:7085, date:'2023-03-25',desc:'每天都写，如果可能话，每天写几次。。',content:'每天都写，如果可能话，每天写几次。你写得多了，也就写得好了。学习如何写作和其他的学问道理是一样的，熟能生巧。写写你自己，写写博客，向出版社投稿。只是写，全情投入的写，练得越多，你的写作水平就提升得越快', },
	{id:3,title:'随时随地记下你的灵感',image:'https://img1.baidu.com/it/u=558856300,3626398774&fm=253&fmt=auto&app=138&f=JPEG?w=750&h=500',type:'大纲写作',assimt:3215, like:2156, date:'2023-03-25',desc:'随身带一本小笔记本(纳博科夫身上装...',content:'随身带一本小笔记本(纳博科夫身上装满了小卡片)，当你对你构思的小说，文章，或是小说里的人物有什么灵感的时候，马上记下来。当你听别人谈话时的只言片语而所有顿悟时，或看到一段散文诗或是一句歌词让你很感动时，都可以马上当他们记下来。灵感总是转瞬即逝，你及时的记录下来，便可以成为你写作的素材。我的习惯是，为我的博客要写的文章列一个清单，不断的补充它。', },
	{id:4,title:'专门的写作时间',image:'https://img1.baidu.com/it/u=749828836,1344853320&fm=253&fmt=auto&app=138&f=JPEG?w=667&h=500',type:'大纲写作',assimt:65221, like:1065, date:'2023-03-25',desc:'每天找一个没有任何打扰的时间段作为专门的写作..',content:'每天找一个没有任何打扰的时间段作为专门的写作时间，让这成为习惯。对我而言，清晨的时间是最佳的，午饭，傍晚，或者深夜的那段时间也可以。无论你是做什么工作的，把写作当作每天必须完成的任务去做。每天至少写半个小时，当然有一个小时更好。若你同我一样，是一个全职的作家，那么你需要写更多的小时，请你不要担心，这只会让你写得更好。', },
	{id:5,title:'随便涂鸦',image:'https://img0.baidu.com/it/u=268687417,2246941700&fm=253&fmt=auto&app=138&f=JPEG?w=750&h=500',type:'大纲写作',assimt:1065, like:1254, date:'2023-03-25',desc:'面对整张的白纸，整版的白屏，无从开始，肯定恐怖。。',content:'面对整张的白纸，整版的白屏，无从开始，肯定恐怖。你会想：我还是看看邮件或是小憩一会了吧!先生，千万别这样。马上开始写，马上打字，你写什么没有关系，只是让我听到你敲键盘的声音吧。只要你开始写了，什么都好办了。像我的话，我喜欢先敲上我的名字和文章的标题，这应该不难吧，然后再慢慢的展开情节，全身心地融入进去…关键是：开始可以随便写写，随便涂鸦，但是尽快开始写正文。', },
	{id:6,title:'集中精神',image:'https://img2.baidu.com/it/u=4020318529,2718588994&fm=253&fmt=auto&app=120&f=JPEG?w=640&h=415',type:'大纲写作',assimt:3215, like:13254, date:'2023-03-25',desc:'写作是一件一心一意的事情，在嘈杂的环境或是同时干着别的',content:'写作是一件一心一意的事情，在嘈杂的环境或是同时干着别的事情，是不可能写好的。写作需要一个安静的环境，需要一点点柔和的背景音乐。即使是最低要求，你也需要在全屏(没有其他软件得干扰)的条件下，使用WriteRoom， DarkRoom，Writer这些写作软件，不受打扰的写作。关掉邮箱，关点MSN和Gtalk，关掉电话和手机，关掉电视，清理掉书桌上无用的东西。清除与写作无关的一切杂念，现在就是写作的时间，好像把自己放进一个盒子里，在没有任何打扰下进入写作状态。', },
	{id:7,title:'先计划，再写',image:'https://img1.baidu.com/it/u=4130245423,816996098&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=333',type:'大纲写作',assimt:62001, like:3226, date:'2023-03-25',desc:'这好像和“随便涂鸦”有些矛盾，实际上不是这样。',content:'这好像和“随便涂鸦”有些矛盾，实际上不是这样。在坐下来正式写之前，先做个计划或是脑子里先预演一下，这是非常管用的办法。每天跑步的时候想想要写的东西，或是散步的时间来个头脑风暴;然后把想到的记下来，做一个扼要的提纲;等真正准备好开始写了，可以很快的展开，因为思路和想法都有了。这里，有一个构思小说的三部曲，可以参考', },
	{id:8,title:'创新',image:'https://img2.baidu.com/it/u=2125231611,1832306026&fm=253&fmt=auto&app=138&f=JPEG?w=890&h=500',type:'大纲写作',assimt:16552, like:75521, date:'2023-03-25',desc:'你需要模仿名家，这并不意味你要跟他们写得一模一样',content:'你需要模仿名家，这并不意味你要跟他们写得一模一样。你可以试试新的写法，从这里学一点，从那里学一点。渐渐地，你就会有了自己的风格，自己的文体，自己的思路。试试一些不一样的表达，或创造一些与众不同的表达方式，每一方法你都可以尝试，看看它到底怎么样，不好就不用呗', },
	{id:9,title:'让故事中的人物进行自我描写',image:'https://img2.baidu.com/it/u=2004930639,2366245425&fm=253&fmt=auto&app=120&f=JPEG?w=805&h=500',type:'人物描写',assimt:12254, like:1002, date:'2023-03-25',desc:'有人说，如果想要做好某件事，就必须自己..',content:`有人说，如果想要做好某件事，就必须自己亲自动手去做。这句话对于故事中的人物来说也同样适用，我们可以考虑让人物角色进行自我描写。

比如：小美看着镜子中的自己：精致干净的五官，乌黑飘逸的头发，高挑苗条的身材，如绸缎般白皙细嫩的皮肤，如莲藕般细长的双手，还有一双没有任何瑕疵的修长的双腿，看到哪里都觉得是那样的美。她突然间冒出一句：“我怎么这么好看，可是那个他到底在哪里？”顿时，她的脸颊一片绯红，她为自己的话语感到惊奇，也有些难堪，好在此时没有其他人在场。她又开始想自己的心事了。

通过小美观察镜子中她的相貌，让人们了解了她的外貌特征，也对她的内心世界和她的心事产生了好奇。

再比如：小王希望自己能像某位明星那样身姿挺拔、身体健壮，也希望自己能像另一位明星那样有担当，有责任心，能力超强。但现实却让他很是郁闷，他有着矮小的身体，背还有点驼，那张让人不可思议的小脸，显得有些尖嘴猴腮；更可恶地是，他生性胆小，遇事犹豫，没有任何自信，这让他很是不爽。

这样的描写，有小王希望变成的样子，也有他的实际相貌，让读者清楚地了解到他的外在特征和内心的焦虑。人物角色在思考理想中的自己，他并不喜欢眼前的自己。

通过这种人物的自我描写，可以让读者明白，人物到底是什么样的人，而且可以由此进行导入，进而描写人物的背景故事。

让人物进行自我描写，可以用第一人称，也可以用第三人称，这种描写方法显得更加个性化，能够让你描写出只有人物自身才能了解的细节和瑕疵。

大部分自我描写可以通过对话形式有序展开。在进行人物自我描写时，需要将描写自然而然地融入到故事中，否则便会显得有些矫揉造作。`, },
	{id:10,title:'用对话描写人物',image:'https://img1.baidu.com/it/u=306622040,4238812923&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=296',type:'人物描写',assimt:33265, like:104, date:'2023-03-25',desc:'人物之间的对话，不仅能够传递某种信息',content:`人物之间的对话，不仅能够传递某种信息，还可以成为小说人物最有力的描写工具。

人物角色所说的每个字、每个词，都有着自己的意义，可以让人物的个性或容貌跃然纸上。所以，一定要谨慎地设置人物对话，让每一句话都有每一句话的意义。

比如：在一家书店里有这样一段对话。“天哪！你又把那些书从书架上撞下来了，你怎么这么不小心，那些书都被你弄脏了。”“凶什么，我不是故意的，这里太拥挤了，连一个下脚的地方都没有。”

从这段对话中，我们可以猜出，一个人可能是书店的售货员或者老板，喜欢责怪别人，没有什么耐心；而另一个人可能是一名顾客，他不经常在这里，对书店不太熟悉。这家书店书架摆放得比较满，显得比较拥挤。我们还可以知道说话人的其他特征，比如这名顾客可能有些笨拙，而且与对方比较熟悉。

在对话中，最好不要使用让人难以理解的词。你设置的任何谜团，都应该是某些秘密或者未解决的冲突，以引发读者的思考，而不是出现在对话中，让读者费解。

对于小说中的一些常规描写，可以用人物的对话内容或方式加以替代。人物角色在对话中进行自我描写时，可以尝试着使用高声喧哗或者轻言细语的方式。

如果你想表达一个女人脾气暴躁，说话声音很大，千万不要直接告诉读者，而可以这样去描写。

“小兔崽子，离我的花盆远点，别把我的花给弄坏了！”她在院子里大声呵斥道。孩子们听到她的叫喊声，连忙战战兢兢地向后退去，远远地离开了花盆所在的位置。

通过这句话，可以让读者感觉到这的确是一个喜欢对孩子大喊大叫的女人。`, },
	{id:11,title:'减少模式化人物形象',image:'https://img0.baidu.com/it/u=876488757,2595086318&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=357',type:'人物描写',assimt:322, like:105, date:'2023-03-25',desc:'许多时候，我们会对人物可能会形成一种固化的印象',content:`许多时候，我们会对人物可能会形成一种固化的印象。比如，南方人精明，北方人豪爽，重庆人泼辣。但事实上并非如此。

在小说写作中，可以在一些地方使用固有的符合预期的人物形象，但大部分情况下不要这样做。是否使用模式化人物，依赖于故事的独特性，要根据故事的发展情况来确定。

在小说中使用模式化的固有人物形象，会给读者呈现出单一刻板的形象，这样不利于人物形象的塑造，也会使小说中的人物千篇一律。

因此，在小说创作中，最好塑造一些打破读者常规认知，能够为其带来惊喜的人物角色。而在以真实人物为原型塑造人物角色时，一定要小心谨慎，确保不要偏离现实，也不能过于模式化。

描绘人物形象应精致而巧妙，突出微小的细节，但不要过多地关注于人物的明显特征，如体重、发色和衣服等，而是要增加一些其他的细节描写，以完美的画面逐渐呈现，凸显人物形象。细节描写的范围应该足够宽广，让故事内容不止于此。

在创作过程中，各种写作技巧和方法可能会有所交叠，因此，运用多种描写方法，认真塑造人物角色，仔细描写人物形象，对于故事的发展起着举足轻重的作用`, },
	{id:12,title:'肖像描写',image:'https://img0.baidu.com/it/u=2636157477,951934988&fm=253&fmt=auto&app=138&f=PNG?w=746&h=500',type:'人物描写',assimt:62250, like:154, date:'2023-03-25',desc:'肖像描写最简单的理解就是描写一个人的模样、姿态等',content:`肖像描写最简单的理解就是描写一个人的模样、姿态等。例如：她的五官非常端正，柳叶眉、高鼻梁，水汪汪的眼睛格外动人，让人看了不禁心生怜爱。这句话就是典型的肖像描写，通过肖像描写，我们可以更好地表达人物的特点，同时也可以更加生动地给读者传递人物的形象，理解文章的主题情感。`, },
	{id:13,title:'语言描写',image:'https://img2.baidu.com/it/u=1770244257,3756534096&fm=253&fmt=auto&app=138&f=JPEG?w=849&h=500',type:'人物描写',assimt:85210, like:154, date:'2023-03-25',desc:'语言描写主要是描写人物的个性化对话或者独白。例如，',content:`语言描写主要是描写人物的个性化对话或者独白。例如， 他说：“等你把这碗吃完了，再吃一碗，今天咱包的饺子多着呢！放开了吃！”这句话就是我们典型的语言描写，通过写某人所说的话来直接的表达人物形象特点，同时也可以从侧面描写出人物的性格，将读者更好地代入一种温暖的氛围`, },
	{id:14,title:'动作描写',image:'https://img1.baidu.com/it/u=1680137419,3580646340&fm=253&fmt=auto&app=138&f=JPEG?w=640&h=427',type:'人物描写',assimt:320, like:17, date:'2023-03-25',desc:'动作描写是最为常见的一种人物描写方法之一...',content:`动作描写是最为常见的一种人物描写方法之一，主要是描述某人的一系列动作或者一个动作来体现人物的形象与特点。例如：他抬头瞭望天空，眼睛顺着皱纹流下，这时他的双手显得有些不知所措，捂住自己的双眼，转过身子背对着我，整个人都有些佝偻。这句话就是典型的动作描写，通过动作描写让人物形象更加的生动和丰富`, },
	{id:15,title:'心理描写',image:'https://img1.baidu.com/it/u=481150296,149078376&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=272',type:'人物描写',assimt:6558, like:321, date:'2023-03-25',desc:'心理描写主要是描写人物的心理活动，并用汉...',content:`心理描写主要是描写人物的心理活动，并用汉字语言表达出来。例如：他心里想如果面前站的这个人是自己的儿子该多好啊！如果他的儿子还活着，估计也到谈婚论嫁的年纪了。通过人物的心理活动描写，可以让人物形象更加的饱满，同时对于情感的表达也有重要的衬托作用。

以上我们讲解了6种人物描写方法中的4种，分别是：肖像描写、语言描写、动作描写和心理描写，这四种也是日常练习中最为常见的人物描写方法。那么你们知道神态描写与概括描写是如何体现的吗？快在评论区分享一下你的知识和见解吧`, },
	{id:16,title:'直接描写',image:'https://img2.baidu.com/it/u=2591683094,1538166369&fm=253&fmt=auto&app=138&f=JPEG?w=600&h=400',type:'心理活动',assimt:1322, like:2115, date:'2023-03-25',desc:'这是最为常见的运用最广泛的一种人物心理描写法，',content:`这是最为常见的运用最广泛的一种人物心理描写法，有的句子中含有“想”等关键的字眼作为明显的标志。“想”字或出现在心理活动之前，或出现在心理活动之后。“想”字后有的用“逗号”，有的用“冒号”等做标示。 



如高晓声的《陈奂生上城》中的如下片断： 

推开房间，看看照出人影的地板，又站住犹豫“脱不脱鞋？”一转念，忿忿想到：“出了五块钱呢！”再也不怕脏，大摇大摆走了进去，往弹簧太师椅上一坐：“管它，坐瘪了不关我事，出了五元钱呢。” 



这样的心理描写就属于直接描写式，它非常恰当地将陈奂生患得患失、狭隘自私的小农经济的心理描写了出来。 

值得强调的是，直接描写人物的心理活动，一定要切合人物的年龄、身份和性格特征。心理描写的文段不宜过长，否则会使文章沉闷，有损人物形象的生动性。`, },
	{id:17,title:'抒情独白',image:'https://img2.baidu.com/it/u=1972511094,3187511812&fm=253&fmt=auto&app=138&f=JPEG?w=442&h=286',type:'心理活动',assimt:9542, like:21154, date:'2023-03-25',desc:'这种刻画人物心理的方法，是用抒情的笔法展示人物的..',content:`这种刻画人物心理的方法，是用抒情的笔法展示人物的内心矛盾和思想斗争。  



我一边跑一边想：看样子是难以逃脱了。扔了米跑吧，山上急等着用用粮食，舍不得丢，――而且就是扔了也不一定能逃得脱；不扔吧，叫敌人追上了也是人粮两空。怎么办呢？……这时，洪七还紧跟着我，呼哧呼哧直喘气呢。我听着他的喘气声，蓦地想出了一个法子。可是当我这样想着的时候，我自己不由得浑身都颤抖了起来：儿子，多好的儿子……这叫我怎么跟他妈交代呢。……可是，不这样又不行，孩子要紧，革命的事业更要紧！也许我能替了孩子，可孩子替不了我呀！……



作者用抒情的笔法，写“我”与儿子洪七给山上的红军送粮，在途中遇到了敌人。在万分危急的情况下，是牺牲儿子保护粮食，还是保护儿子？“我”的内心斗争非常激烈，心情极度矛盾、复杂。`, },
	{id:18,title:'梦境描绘',image:'https://img0.baidu.com/it/u=2126655698,72863408&fm=253&fmt=auto&app=138&f=JPEG?w=600&h=450',type:'心理活动',assimt:3265, like:2254, date:'2023-03-25',desc:'这是我们容易忽略的心理描写法。梦境是人所想的集中表现',content:`这是我们容易忽略的心理描写法。梦境是人所想的集中表现，它同样能揭示人物的性格特征，深化文章的主题等。梦境描绘的文字一般较多，下面选一较短的进行说明。



这里宝玉昏昏默默，只见蒋玉菡走了进来，诉说忠顺府拿他之事；只见金钏儿进来哭说为他投井之情。宝玉半梦半醒，都不在意。忽又觉有人推他，恍恍忽忽听得有人悲戚之声。宝玉从梦中惊醒，睁眼一看，不是别人，却是林黛玉。

这是曹雪芹《宝玉挨打》中的文字，作者通过梦境揭示出了宝玉关心体贴少女，思想叛逆，具有民主思想的性格特征`, },
	{id:19,title:'心理分析',image:'https://img0.baidu.com/it/u=1932595640,3466705276&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=316',type:'心理活动',assimt:665, like:2214, date:'2023-03-25',desc:'这种心理描写的方法通过剖析人物的心理来展现人物的内心世界',content:`这种心理描写的方法通过剖析人物的心理来展现人物的内心世界，让读者对人物的所思所想更加明了。
如莫泊桑在小说《项链》的如下片断： 
她一向就想望着得人欢心，被人艳羡，具有诱惑力而被人追求。她陶醉于自己的美貌胜过一切女宾。`, },
	{id:20,title:'行动表现',image:'https://img2.baidu.com/it/u=2611825594,3260699791&fm=253&fmt=auto&app=138&f=JPEG?w=720&h=400',type:'心理活动',assimt:105, like:2547, date:'2023-03-25',desc:'通过恰当的描写人物富有鲜明个性的动作',content:`通过恰当的描写人物富有鲜明个性的动作，传神地揭示出人物的心理活动。施耐庵在《林教头风雪山神庙》中对林冲听说陆谦追杀至沧州，不觉大怒，于是用了“买”“带”“寻”等几个连续的动词，表现出林冲报仇急切的激愤心理。`, },
	{id:21,title:'环境衬托',image:'https://img2.baidu.com/it/u=1288663812,2635064509&fm=253&fmt=auto&app=138&f=JPEG?w=750&h=500',type:'心理活动',assimt:6542, like:2013, date:'2023-03-25',desc:'衬托人物心情的景物描写要求作者抓住景物特征',content:`衬托人物心情的景物描写要求作者抓住景物特征，紧扣人物的心理，最好从视觉、嗅觉、触觉、听觉等方面着墨，将人物的悲喜之情恰当地衬托出来`, },
	{id:22,title:'幻觉展现式',image:'https://img2.baidu.com/it/u=110186989,427650663&fm=253&fmt=auto&app=138&f=JPEG?w=750&h=500',type:'心理活动',assimt:231, like:2100, date:'2023-03-25',desc:'这种人物心理的描写，是通过对人物幻觉的展示',content:`这种人物心理的描写，是通过对人物幻觉的展示，来刻画人物的心理，能揭示文章的主题。如安徒生的《卖火柴的女孩》中的如下片断： 
她又擦了一根。火柴燃起来了，发出亮光来了。亮光落在墙上，那儿就变得像薄纱那么透明，她可以从那儿一直看到屋里：桌上铺着雪白的台布，摆着精致的盘碗，填满了苹果和葡萄干的烤鹅正冒着热气。更妙的是，这只鹅从盘子里跳下来，背上插着刀和叉，摇摇摆摆地在地板上走着，一直向这个可怜的小女孩走来――这时候，火柴又灭了，面前没有别的，只有一堵又厚又冷的墙。”
以上的幻觉描写，很好的刻画出小女孩天真、单纯和对温饱渴求的心理。`, },
	{id:23,title:'结合需要突出的侧重点',image:'https://img2.baidu.com/it/u=4062226468,950619642&fm=253&fmt=auto&app=138&f=JPEG?w=750&h=500',type:'环境描写',assimt:3652, like:4501, date:'2023-03-25',desc:'环境描写，不应该是为了写而写。环境描写，是能够细化一下的',content:`环境描写，不应该是为了写而写。环境描写，是能够细化一下的，比如：空间、色彩、动静态、象征、寓意等等……想营造什么氛围就往什么方向写，再结合需要突出的侧重点写。

但要注意的是，如果全部描写的话，会显得臃肿，甚至占用太多篇幅还显得在无意义的水文。写之前，一定要明白：自己所想写的环境描写的作用是什么，然后结合具体情况具体分析。像一些日常的场景，比如生活环境这种，房间应该侧重静态布局，街区侧重动态色彩。

如果是想借以营造氛围，或者服务于剧情，提升代入感的。下面，以战斗场景为例做简单说明。那么应该侧重在空间上。大小、远近、尤其是一些静态的布局，描写清晰，对战斗场景的代入是很有帮助的。而像寓意、色彩之类倒不用大书特书。

如果是想借以借景抒情，可以侧重在色彩、动静态、寓意这方面。尤其是寓意，往往它就代表着要表达的情感，这样更容易牵动读者的情绪。

如果是为了切入某个角色、或者某段剧情，那么可以把环境描写的重点放在，“动静态的远近切换”上，可以这样描述：从远到近切入到某个角色身上，或者通过正在暗中观察的谁谁谁，他所看到的表述出来。他看到的，肯定是动态的，可以是从近到远的，也可以是从远到近的。`, },
	{id:24,title:'一定要和主角产生联系',image:'https://img0.baidu.com/it/u=401290179,3804293433&fm=253&fmt=auto&app=138&f=JPEG?w=952&h=500',type:'环境描写',assimt:2514, like:2105, date:'2023-03-25',desc:'什么是好的环境描写？最主要的一点就是和主角..',content:`什么是好的环境描写？最主要的一点就是和主角产生关系。

1、比如说，新人进入新奇的场景包括看到牛人打架，又或者其他的一些场景，最好都是从主角角度出发的，可以加上一些主角个人的感觉，而不是上帝视角的描写。

2、从剧情角度出发的话， 你所描写的环境需要有主角的因素，比如说描写的这个打斗场面和主角切身相关，这样的剧情能够让读者了解这个环境，而且这些环境，是能够推动剧情进展。注意：很多新人作者一上来，就是喜欢写世界大背景，和主角没关系，会给读者很疏离的感觉，且不说，剧情写得好不好， 至少得先写主角的剧情，主角主导的剧情。在这方面大家可以学习一下《明朝败家子》里面的主角，不管是面对谁， 甚至在君王的剧情里面，皇帝的一举一动，出宫、发怒都是和主角息息相关。请大家对号入座，自己是不是也这样的问题？主角没出现之前就是各种世纪大战，甚至是正文里面，各种大战和打斗。剧情环境 真正是主角需要 ，即便文笔不怎么好，读者都是期待的

3、具体到写法上，可以尝试“镜头式的画面描写”，写出画面感。这个跟传统小说的那种叙述不一样 （对比看就是《明朝败家子》和《女巫》 这两个算是比较明显的对比 一个偏画面式的写法一个偏传统文学的叙述型）。这种写法涉及到了不少的环境描写、打斗场面。运用这个写法，画面会更加地让人身临其境，这样的环境描写就会让读者很有代入感。

举例子 就是斗破第一次见云韵和遮天开头。云韵和五阶魔兽的大战，是从萧炎的视角看过去的，中间包括了他和药老之间的分析对话，然后这个打斗之间很明显和整个他要走的路线有关，甚至之后引出他碰到云韵的剧情。而《遮天》开头那里，九龙拉棺也有作者视角，然后这个和主角息息相关，所有的描写都是推动了剧情，没有整个停滞在那里`, },
	{id:25,title:'尝试短句，未尝不可',image:'https://img1.baidu.com/it/u=64425451,4223728621&fm=253&fmt=auto&app=138&f=JPEG?w=833&h=469',type:'环境描写',assimt:850, like:6520, date:'2023-03-25',desc:'环境描写还是要看具体作品的设定。如果是都市..',content:`环境描写还是要看具体作品的设定。如果是都市文，环境描写相对来说什么用，相对来说，最多重生文用来烘托一下那种情怀的氛围。如果是异界文，主要就是对新地图进行环境描写，或者那些“想象力独特的奇观”。可以参照学习乌贼的《巨人王庭》，里面的景物描写就是有用而且不错的。

就个人的观察来看，网文中大部分的环境描写，不少是起着“交代”的作用，对故事有用的环境描写，怎么写都不会尴尬的。（对于新人而言）如果觉得自己实在是写不好环境描写。可以用短句的形式。 墙上有XXX名画，柜子里全是XX奖杯，办公桌是XX名贵的木材，不用多加额外的修饰，把整个环境里重要的东西点出来了。新人来说，就不用考虑什么寓情于景，情景交融了，能把画面好好讲出来就差不多了。配合视角的移动，让读者先看到什么，再看到什么，最后看到什么，其实画面感就有了`, },
	{id:26,title:'一定要跟着剧情走',image:'https://img0.baidu.com/it/u=3344632669,1152868819&fm=253&fmt=auto&app=138&f=JPEG?w=733&h=500',type:'环境描写',assimt:2212, like:5401, date:'2023-03-25',desc:'先不说好的，先说说比较差的环境描写，可能有点..',content:`先不说好的，先说说比较差的环境描写，可能有点类似学生时代的作文，大段大段的景色描写，但跟角色，以及接下来要发生的故事都没有关联，就显得十分的生硬和突兀。

环境描写一定要跟着剧情走，如果过多着笔环境，或者说不擅长环境描写，有可能会让作品反而丧失了节奏感，环境只是一个推动剧情的辅助。

什么是好的环境描写呢？应该是有交代信息的作用的，或者是为了接下来的剧情做铺垫。又或者是，可以烘托当下剧情所需要的气氛的，这些一般都不会显得尴尬。

总而言之，能为剧情服务的环境描写，就是加分项。

个人来看，网文中的环境描写，是用于完善人物，剧情，或是故事背景，所以不能用传统文学那种的环境写法去要求。比如下雨代表忧郁，出太阳代表雨过天晴，类似的传统文学的写法，在网文世界就是画蛇添足，鲁迅先生那种“墙外有两株树，一株是枣树，另一株也是枣树”这种环境描写，读者更加会`, },
	{id:27,title:'名著描写片段摘录1',image:'https://img2.baidu.com/it/u=3059031778,1983863833&fm=253&fmt=auto&app=138&f=JPEG?w=667&h=500',type:'环境描写',assimt:6854, like:1054, date:'2023-03-25',desc:'她已经陶醉在欢乐之中，什么也不想，只是兴奋地',content:`她已经陶醉在欢乐之中，什么也不想，只是兴奋地、发狂地跳舞。她的美丽战胜了一切，她的成功充满了光辉，所有这些人都对自己殷勤献媚、阿谀赞扬、垂涎欲滴，妇人心中认为最甜美的胜利已完全握在手中，她便在这一片幸福的云中舞着。     ——莫泊桑（法）《项链》`, },
	{id:28,title:'名著描写片段摘录2',image:'https://img2.baidu.com/it/u=22436676,3945749501&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=281',type:'环境描写',assimt:504, like:254, date:'2023-03-25',desc:'“可是一个人并不是生来要给打败的，”他说',content:`“可是一个人并不是生来要给打败的，”他说，“你尽可把他消灭掉，可就是打不败他。”他想：不过这条鱼给我弄死了，我倒是过意不去。现在倒霉的时刻就要来到，我连鱼叉也给丢啦。“Detuso”这个东西，既残忍，又能干，既强壮，又聪明。可我比它更聪明。也许不吧，他想。也许我只是比它多了个武器吧。

——海明威（美）《老人与海》`, },
	{id:29,title:'名著描写片段摘录3',image:'https://img1.baidu.com/it/u=724372402,4275981490&fm=253&fmt=auto&app=138&f=JPG?w=1176&h=500',type:'环境描写',assimt:2110, like:321, date:'2023-03-25',desc:'这林黛玉常听得母亲说过，他外祖母家与别家不同',content:`这林黛玉常听得母亲说过，他外祖母家与别家不同。他近日所见的这几个三等仆妇，吃穿用度，已是不凡了，何况今至其家。因此步步留心，时时在意，不肯轻易多说一句话，多行一步路，惟恐被人耻笑了他去。

——曹雪芹《红楼梦》`, },

];


const  _ut = {
	
	getDataList(){
		return _data;
	},
	getDataById(id){
		return _data.find(item=>{return item.id==id});
	},
	getDataListByType(type){
		let filters=_data.filter(item=>{return item.type==type});
		console.log('getDataListByType',type,filters)
		return filters
	},
	getGuess(){
		return [this.getDataById(1),this.getDataById(3),this.getDataById(9),this.getDataById(15),]
	}
	}
export  default _ut;